// Напишіть функцію, яка перевіряє правильність логіна. Правильний логін - рядок від 2 до 10 символів, що містить лише букви та числа, 
// номер не може бути першим. Функція має приймати рядок і знаходити усі числа в цьому рядку, включаючи числа з плаваючою комою (наприклад, 3.4).
function checkLogin(str) {
    const pattern = /^(?!\d)(?!.*-$)[A-Za-z0-9_-]{2,10}$/;
    const nums = str.match(/[-+]?\d*\.?\d+/g);
    if (pattern.test(str)) {
        if (nums) {
            return [true, ...nums.map(num => Number(num))];
        }
        return true;
    }
    return false;
}